from Animal import *
from Animal_types import *

def main():
    # א. הגדרת הרשימה (כולל אובייקט שאינו חיה לצורך בדיקת ה-isinstance)
    animals = [Dog('Poodle'), Cat('Black'), "I am not an animal"]

    print("--- Polymorphism in Action ---")
    # ג. לולאה עם בדיקת isinstance
    for animal in animals:
        if isinstance(animal, Animal):
            print(f"The animal says: {animal.speak()}")
        else:
            print(f"Skipping: {animal} is not an instance of Animal.")

if __name__ == "__main__":
    main()

#סעיף ב- מה שנראה כמו ברווז ומגעגע כמו ברווז הוא ברווז"
#הכוונה היא שבפייתון סוג (טיפוס) האובייקט נקבע לפי ההתנהגות שלו (המתודות) ולא לפי ההגדרות הרשמיות שלו (הירושה).
#אם אובייקט תומך בפעולה מסוימת, פייתון תאפשר להריץ אותה בלי לשאול שאלות מיותרות.

#סעיף ד- מהו פולימורפיזם ומהי תוצאתו
#פולימורפיזם (רב-צורתיות) היא היכולת של אובייקטים מסוגים שונים להגיב לאותה פקודה, כאשר כל אובייקט מבצע אותה בדרך הייחודית לו.
#הוא מאפשר לכל אובייקט לקרוא לאותה הפונקציה, ולקבל התנהגות שונה לחלוטין עבור כל אובייקט, מבלי שיצטרך לבדוק את עצמו בתנאי
#התוצאה היא קוד גמיש ודינמי שקל להרחיב אותו על ידי הוספת מחלקות חדשות, מבלי לשנות את הלוגיקה שכבר קיימת בתוכנית.